results/node/adonis.txt
Bundle: 1.2 MB
Startup: 384.0 ms
Memory before: 118.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     17244.97    3703.11   24981.96
  Latency       28.99ms   106.00ms      5.11s
  HTTP codes:
    1xx - 0, 2xx - 172399, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.72MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     15233.93    2987.34   20986.34
  Latency       32.81ms    79.16ms      3.95s
  HTTP codes:
    1xx - 0, 2xx - 152416, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     3.89MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13431.11    1344.18   18518.70
  Latency       37.19ms   143.72ms      3.04s
  HTTP codes:
    1xx - 0, 2xx - 133870, 3xx - 0, 4xx - 0, 5xx - 0
    others - 775
  Errors:
       timeout - 775
  Throughput:     4.20MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       103.54     144.94     545.16
  Latency       95.62ms    12.49ms   183.90ms
  HTTP codes:
    1xx - 0, 2xx - 1050, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.38GB/s

Memory after: 225.5 MB