results/node/effect.txt
Bundle: 357.3 KB
Startup: 106.7 ms
Memory before: 86.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     22276.36    4111.20   34095.14
  Latency       22.48ms   282.71ms     10.01s
  HTTP codes:
    1xx - 0, 2xx - 222287, 3xx - 0, 4xx - 0, 5xx - 0
    others - 8
  Errors:
       timeout - 8
  Throughput:     4.48MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     19446.69    1724.60   22944.09
  Latency       25.69ms    69.36ms      4.88s
  HTTP codes:
    1xx - 0, 2xx - 194430, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.68MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     14511.76    2410.47   20964.17
  Latency       34.42ms    94.38ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 144652, 3xx - 0, 4xx - 0, 5xx - 0
    others - 585
  Errors:
       timeout - 585
  Throughput:     4.35MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       106.35      93.37     444.31
  Latency       93.63ms    10.26ms   171.89ms
  HTTP codes:
    1xx - 0, 2xx - 1070, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.41GB/s

Memory after: 187.1 MB