results/node/elysia-aot.txt
Bundle: 141.6 KB
Startup: 114.6 ms
Memory before: 84.7 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     44910.32    5257.25   48868.67
  Latency       11.14ms    49.69ms      3.56s
  HTTP codes:
    1xx - 0, 2xx - 448016, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.96MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     32561.40    1546.03   34300.43
  Latency       15.35ms    46.80ms      3.50s
  HTTP codes:
    1xx - 0, 2xx - 325495, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.78MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     29887.20    1701.82   34798.23
  Latency       16.72ms    78.62ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 298435, 3xx - 0, 4xx - 0, 5xx - 0
    others - 409
  Errors:
       timeout - 409
  Throughput:     8.93MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec        89.14     147.53     501.21
  Latency      111.88ms    12.53ms   181.99ms
  HTTP codes:
    1xx - 0, 2xx - 900, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.18GB/s

Memory after: 185.6 MB