results/node/elysia.txt
Bundle: 192.1 KB
Startup: 115.3 ms
Memory before: 86.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     44077.17    5220.65   47970.58
  Latency       11.34ms    55.17ms      3.81s
  HTTP codes:
    1xx - 0, 2xx - 440331, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     8.81MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     31526.30    3608.75   65219.60
  Latency       15.91ms    45.25ms      3.39s
  HTTP codes:
    1xx - 0, 2xx - 313860, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.50MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     28493.04    3860.36   32126.71
  Latency       17.55ms    56.07ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 284461, 3xx - 0, 4xx - 0, 5xx - 0
    others - 137
  Errors:
       timeout - 137
  Throughput:     8.51MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec        90.12     151.36     546.48
  Latency      109.65ms    10.79ms   176.64ms
  HTTP codes:
    1xx - 0, 2xx - 919, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.20GB/s

Memory after: 186.2 MB