results/node/express.txt
Bundle: 602.7 KB
Startup: 119.9 ms
Memory before: 80.6 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     13622.46    1696.12   15028.61
  Latency       36.99ms   427.45ms     10.75s
  HTTP codes:
    1xx - 0, 2xx - 136665, 3xx - 0, 4xx - 0, 5xx - 0
    others - 7
  Errors:
       timeout - 7
  Throughput:     3.53MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     12802.60     537.71   13446.27
  Latency       38.96ms   340.47ms     10.05s
  HTTP codes:
    1xx - 0, 2xx - 128202, 3xx - 0, 4xx - 0, 5xx - 0
    others - 124
  Errors:
       timeout - 124
  Throughput:     3.75MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec      9817.00    1241.18   20297.00
  Latency       50.89ms   274.30ms      5.02s
  HTTP codes:
    1xx - 0, 2xx - 97689, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1129
  Errors:
       timeout - 1129
  Throughput:     3.45MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       120.92     152.63     600.88
  Latency       82.81ms     8.73ms   152.59ms
  HTTP codes:
    1xx - 0, 2xx - 1210, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.59GB/s

Memory after: 183.3 MB