results/node/fastify.txt
Bundle: 553.4 KB
Startup: 156.8 ms
Memory before: 92.4 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     47171.84    5197.63   51051.31
  Latency       10.60ms    29.48ms      2.44s
  HTTP codes:
    1xx - 0, 2xx - 470761, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    10.23MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     42873.92    5273.66   46713.60
  Latency       11.64ms    50.71ms      3.59s
  HTTP codes:
    1xx - 0, 2xx - 429128, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    11.00MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     26403.05    2609.94   28076.79
  Latency       18.93ms    41.56ms      2.01s
  HTTP codes:
    1xx - 0, 2xx - 263939, 3xx - 0, 4xx - 0, 5xx - 0
    others - 52
  Errors:
       timeout - 52
  Throughput:     8.34MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
[======================================================================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       119.91     167.93     590.25
  Latency       84.05ms     7.67ms   150.71ms
  HTTP codes:
    1xx - 0, 2xx - 1190, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     1.57GB/s

Memory after: 222.2 MB